"use struct"

const header = ["Название книги", "Жанр (жанры)", "Автор", "Год", "Страна", "Число копий по миру (в млн.)"]

var legendData = [
    { name: "Минимальное число копий", color: "blue" },
    { name: "Максимальное число копий", color: "red" }
];


const books = [
  {
    "Название книги": "Don Quixote",
    "Жанр (жанры)": ["Классика", "Приключения"],
    "Автор": "Miguel de Cervantes",
    "Год": 1605,
    "Страна": "Испания",
    "Число копий по миру (в млн.)": 500
  },
  {
    "Название книги": "A Tale of Two Cities",
    "Жанр (жанры)": ["Исторический роман"],
    "Автор": "Charles Dickens",
    "Год": 1859,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 200
  },
  {
    "Название книги": "The Lord of the Rings",
    "Жанр (жанры)": ["Фэнтези"],
    "Автор": "J.R.R. Tolkien",
    "Год": 1954,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 150
  },
  {
    "Название книги": "Harry Potter and the Philosopher's Stone",
    "Жанр (жанры)": ["Фэнтези", "Молодежная литература"],
    "Автор": "J.K. Rowling",
    "Год": 1997,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 120
  },
  {
    "Название книги": "The Hobbit",
    "Жанр (жанры)": ["Фэнтези"],
    "Автор": "J.R.R. Tolkien",
    "Год": 1937,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 100
  },
  {
    "Название книги": "Twilight",
    "Жанр (жанры)": ["Фэнтези", "Роман"],
    "Автор": "Stephenie Meyer",
    "Год": 2005,
    "Страна": "США",
    "Число копий по миру (в млн.)": 100
  },
  {
    "Название книги": "And Then There Were None",
    "Жанр (жанры)": ["Детектив"],
    "Автор": "Agatha Christie",
    "Год": 1939,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 100
  },
  {
    "Название книги": "Dream of the Red Chamber",
    "Жанр (жанры)": ["Классика", "Роман"],
    "Автор": "Cao Xueqin",
    "Год": 1791,
    "Страна": "Китай",
    "Число копий по миру (в млн.)": 100
  },
  {
    "Название книги": "The Lion, the Witch and the Wardrobe",
    "Жанр (жанры)": ["Фэнтези", "Детская литература"],
    "Автор": "C.S. Lewis",
    "Год": 1950,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 85
  },
  {
    "Название книги": "The Adventures of Pinocchio",
    "Жанр (жанры)": ["Детская литература"],
    "Автор": "Carlo Collodi",
    "Год": 1883,
    "Страна": "Италия",
    "Число копий по миру (в млн.)": 80
  },
  {
    "Название книги": "Harry Potter and the Chamber of Secrets",
    "Жанр (жанры)": ["Фэнтези", "Молодежная литература"],
    "Автор": "J.K. Rowling",
    "Год": 1998,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 77
  },
  {
    "Название книги": "The Da Vinci Code",
    "Жанр (жанры)": ["Детектив", "Триллер"],
    "Автор": "Dan Brown",
    "Год": 2003,
    "Страна": "США",
    "Число копий по миру (в млн.)": 80
  },
  {
    "Название книги": "She: A History of Adventure",
    "Жанр (жанры)": ["Приключения", "Фэнтези"],
    "Автор": "H. Rider Haggard",
    "Год": 1887,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 83
  },
  {
    "Название книги": "The Alchemist",
    "Жанр (жанры)": ["Философия", "Роман"],
    "Автор": "Paulo Coelho",
    "Год": 1988,
    "Страна": "Бразилия",
    "Число копий по миру (в млн.)": 65
  },
  {
    "Название книги": "The Catcher in the Rye",
    "Жанр (жанры)": ["Роман"],
    "Автор": "J.D. Salinger",
    "Год": 1951,
    "Страна": "США",
    "Число копий по миру (в млн.)": 65
  },
  {
    "Название книги": "Harry Potter and the Prisoner of Azkaban",
    "Жанр (жанры)": ["Фэнтези", "Молодежная литература"],
    "Автор": "J.K. Rowling",
    "Год": 1999,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 65
  },
  {
    "Название книги": "Harry Potter and the Goblet of Fire",
    "Жанр (жанры)": ["Фэнтези", "Молодежная литература"],
    "Автор": "J.K. Rowling",
    "Год": 2000,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 65
  },
  {
    "Название книги": "Harry Potter and the Order of the Phoenix",
    "Жанр (жанры)": ["Фэнтези", "Молодежная литература"],
    "Автор": "J.K. Rowling",
    "Год": 2003,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 65
  },
  {
    "Название книги": "Harry Potter and the Half-Blood Prince",
    "Жанр (жанры)": ["Фэнтези", "Молодежная литература"],
    "Автор": "J.K. Rowling",
    "Год": 2005,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 65
  },
  {
    "Название книги": "Harry Potter and the Deathly Hallows",
    "Жанр (жанры)": ["Фэнтези", "Молодежная литература"],
    "Автор": "J.K. Rowling",
    "Год": 2007,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 65
  },
  {
    "Название книги": "The Bridges of Madison County",
    "Жанр (жанры)": ["Роман"],
    "Автор": "Robert James Waller",
    "Год": 1992,
    "Страна": "США",
    "Число копий по миру (в млн.)": 60
  },
  {
    "Название книги": "One Hundred Years of Solitude",
    "Жанр (жанры)": ["Магический реализм"],
    "Автор": "Gabriel García Márquez",
    "Год": 1967,
    "Страна": "Колумбия",
    "Число копий по миру (в млн.)": 50
  },
  {
    "Название книги": "Lolita",
    "Жанр (жанры)": ["Роман"],
    "Автор": "Vladimir Nabokov",
    "Год": 1955,
    "Страна": "США",
    "Число копий по миру (в млн.)": 50
  },
  {
    "Название книги": "Anne of Green Gables",
    "Жанр (жанры)": ["Детская литература"],
    "Автор": "L.M. Montgomery",
    "Год": 1908,
    "Страна": "Канада",
    "Число копий по миру (в млн.)": 50
  },
  {
    "Название книги": "Black Beauty",
    "Жанр (жанры)": ["Детская литература"],
    "Автор": "Anna Sewell",
    "Год": 1877,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 50
  },
  {
    "Название книги": "Charlotte's Web",
    "Жанр (жанры)": ["Детская литература"],
    "Автор": "E.B. White",
    "Год": 1952,
    "Страна": "США",
    "Число копий по миру (в млн.)": 50
  },
  {
    "Название книги": "The Very Hungry Caterpillar",
    "Жанр (жанры)": ["Детская литература"],
    "Автор": "Eric Carle",
    "Год": 1969,
    "Страна": "США",
    "Число копий по миру (в млн.)": 50
  },
  {
    "Название книги": "The Tale of Peter Rabbit",
    "Жанр (жанры)": ["Детская литература"],
    "Автор": "Beatrix Potter",
    "Год": 1902,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 45
  },
  {
    "Название книги": "To Kill a Mockingbird",
    "Жанр (жанры)": ["Роман"],
    "Автор": "Harper Lee",
    "Год": 1960,
    "Страна": "США",
    "Число копий по миру (в млн.)": 40
  },
  {
    "Название книги": "Angels & Demons",
    "Жанр (жанры)": ["Детектив", "Триллер"],
    "Автор": "Dan Brown",
    "Год": 2000,
    "Страна": "США",
    "Число копий по миру (в млн.)": 40
  },
  {
    "Название книги": "War and Peace",
    "Жанр (жанры)": ["Исторический роман"],
    "Автор": "Leo Tolstoy",
    "Год": 1869,
    "Страна": "Россия",
    "Число копий по миру (в млн.)": 36
  },
  {
    "Название книги": "The Kite Runner",
    "Жанр (жанры)": ["Роман"],
    "Автор": "Khaled Hosseini",
    "Год": 2003,
    "Страна": "Афганистан/США",
    "Число копий по миру (в млн.)": 31
  },
  {
    "Название книги": "1984",
    "Жанр (жанры)": ["Антиутопия", "Научная фантастика"],
    "Автор": "George Orwell",
    "Год": 1949,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 30
  },
  {
    "Название книги": "The Fault in Our Stars",
    "Жанр (жанры)": ["Роман", "Молодежная литература"],
    "Автор": "John Green",
    "Год": 2012,
    "Страна": "США",
    "Число копий по миру (в млн.)": 23
  },
  {
    "Название книги": "The Girl on the Train",
    "Жанр (жанры)": ["Триллер"],
    "Автор": "Paula Hawkins",
    "Год": 2015,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 20
  },
  {
    "Название книги": "Life of Pi",
    "Жанр (жанры)": ["Приключения", "Философия"],
    "Автор": "Yann Martel",
    "Год": 2001,
    "Страна": "Канада",
    "Число копий по миру (в млн.)": 15
  },
  {
    "Название книги": "Pride and Prejudice",
    "Жанр (жанры)": ["Роман"],
    "Автор": "Jane Austen",
    "Год": 1813,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 20
  },
  {
    "Название книги": "The Great Gatsby",
    "Жанр (жанры)": ["Роман"],
    "Автор": "F. Scott Fitzgerald",
    "Год": 1925,
    "Страна": "США",
    "Число копий по миру (в млн.)": 25
  },
  {
    "Название книги": "Jane Eyre",
    "Жанр (жанры)": ["Роман"],
    "Автор": "Charlotte Brontë",
    "Год": 1847,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 20
  },
  {
    "Название книги": "Wuthering Heights",
    "Жанр (жанры)": ["Роман"],
    "Автор": "Emily Brontë",
    "Год": 1847,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 20
  },
  {
    "Название книги": "Crime and Punishment",
    "Жанр (жанры)": ["Роман"],
    "Автор": "Fyodor Dostoevsky",
    "Год": 1866,
    "Страна": "Россия",
    "Число копий по миру (в млн.)": 25
  },
  {
    "Название книги": "Animal Farm",
    "Жанр (жанры)": ["Сатира", "Аллегория"],
    "Автор": "George Orwell",
    "Год": 1945,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 20
  },
  {
    "Название книги": "The Brothers Karamazov",
    "Жанр (жанры)": ["Роман"],
    "Автор": "Fyodor Dostoevsky",
    "Год": 1880,
    "Страна": "Россия",
    "Число копий по миру (в млн.)": 20
  },
  {
    "Название книги": "Les Misérables",
    "Жанр (жанры)": ["Исторический роман"],
    "Автор": "Victor Hugo",
    "Год": 1862,
    "Страна": "Франция",
    "Число копий по миру (в млн.)": 20
  },
  {
    "Название книги": "The Count of Monte Cristo",
    "Жанр (жанры)": ["Приключения"],
    "Автор": "Alexandre Dumas",
    "Год": 1844,
    "Страна": "Франция",
    "Число копий по миру (в млн.)": 20
  },
  {
    "Название книги": "Brave New World",
    "Жанр (жанры)": ["Антиутопия", "Научная фантастика"],
    "Автор": "Aldous Huxley",
    "Год": 1932,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 15
  },
  {
    "Название книги": "The Picture of Dorian Gray",
    "Жанр (жанры)": ["Роман"],
    "Автор": "Oscar Wilde",
    "Год": 1890,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 15
  },
  {
    "Название книги": "The Old Man and the Sea",
    "Жанр (жанры)": ["Роман"],
    "Автор": "Ernest Hemingway",
    "Год": 1952,
    "Страна": "США",
    "Число копий по миру (в млн.)": 15
  },
  {
    "Название книги": "Frankenstein",
    "Жанр (жанры)": ["Готика", "Научная фантастика"],
    "Автор": "Mary Shelley",
    "Год": 1818,
    "Страна": "Великобритания",
    "Число копий по миру (в млн.)": 15
  },
  {
    "Название книги": "Dracula",
    "Жанр (жанры)": ["Готика", "Ужасы"],
    "Автор": "Bram Stoker",
    "Год": 1897,
    "Страна": "Ирландия",
    "Число копий по миру (в млн.)": 15
  },
  {
    "Название книги": "The Little Prince",
    "Жанр (жанры)": ["Детская литература", "Философия"],
    "Автор": "Antoine de Saint-Exupéry",
    "Год": 1943,
    "Страна": "Франция",
    "Число копий по миру (в млн.)": 200
  }
]